{"default_conversation":"Node0","nodes":{"Node0":{"Line0":"student","type":"Conversation"},"Node1":{"Line0":"What are we reviewing next, Teacher?","Size":1,"type":"Speech"},"Node2":{"Line0":"The Basics","Line1":"Queen and Country","Line2":"History","Line3":"Nothing more, for now","Size":4,"type":"Choice"},"Node3":{"Line0":"You are the royal astronomancer. While our people know the stars and watch them, you have learned to listen to them as well, and you are teaching me to carry this sacred role forward one day. We are tasked to find out what they have to say that could help our people and our Queen.","Line1":"Stars never lie. However, they do not see everything, and it is important to compare what you know and speak to others.","Line2":"The most important secret that must be known by all astronomancers is that certain rare stars have motivations of their own, and will not simply share what they saw. We must be wary of them, for they do not look kindly upon us.","Size":3,"type":"Speech"},"Node4":{"Size":4,"type":"Mux"},"Node5":{"Line0":"Our Queen, long may she reign, rules this city-state. Her crown used to command fealty across the valley and onto the Mountain, but the realm has diminished in recent generations.","Line1":"The worst of the diminishment has come from a violent city-state that declared its own crown some generations back, and is ruled by a dynasty who call themselves Sorcerers, but are whispered to be in league with the fire demon out of legend that brings havoc.","Line2":"The Queen trusts you absolutely, as her royal astronomancer, and hopes that you can learn secrets from the stars to help our people weather the time of the comet.","Size":3,"type":"Speech"},"Node6":{"Line0":"Thank you, Teacher.","Size":1,"type":"Speech"},"Node7":{"Line0":"In the beginning, humans emerged from the water, onto the Mountain.","Line1":"We learned to be good, and to fear the fire demon. A Sorcerer-King came to rule over us, but soon fell due to his own wicked ways.","Line2":"A cult of Day and cult of Night went to war. The cult of Night triumphed, which is why we are all taught to watch the stars from a young age.","Line3":"There was a time of unity, but it came to an end. Our Queen is in the line of those benevolent rulers, but now there are many other city-states who do not follow her.","Line4":"This includes our neighbors of the Sorcerer-Dynasty.","Size":5,"type":"Speech"}},"sc":{"Node0":{"0":{"to":"Node4","to_slot":3}},"Node1":{"0":{"to":"Node2","to_slot":0}},"Node2":{"0":{"to":"Node3","to_slot":0},"1":{"to":"Node5","to_slot":0},"2":{"to":"Node7","to_slot":0},"3":{"to":"Node6","to_slot":0}},"Node3":{"0":{"to":"Node4","to_slot":0}},"Node4":{"0":{"to":"Node1","to_slot":0}},"Node5":{"0":{"to":"Node4","to_slot":1}},"Node7":{"0":{"to":"Node4","to_slot":2}}}}