{"default_conversation":"Node0","nodes":{"Node0":{"Line0":"sunrise","type":"Conversation"},"Node1":{"Line0":"As the Sun rises, you consider what you learned.","Line1":"The comet continues to grow, day by day, its tail stretching across the sky.","Size":2,"type":"Speech"},"Node10":{"Size":2,"type":"Mux"},"Node11":{"Line0":"You decide it would be wisest not to. Who knows what else it would summon?","Line1":"The comet continues to grow, day by day, its tail stretching across the sky.","Size":2,"type":"Speech"},"Node12":{"Line0":"The comet continues to grow, day by day, its tail stretching across the sky.","Line1":"Three nights later, you travel to the edge of the lake you were told of. You contemplate the stars, and watch closely as the first glow of the sunrise appears.","Line2":"When the star falls, it appears as a trail of beautiful, sparkling gems, so much closer and faster-moving than the comet. It's strangely quiet, until, like a crack of thunder, it gets very loud.","Line3":"The blast of air knocks you off your feet, so you hear the motion from the center of the crater before you see it. A burning core, a stone aflame like a log, sits at the center.","Line4":"As you look at it, it beckons to you in your mind. When you reach out to touch it, it burns, but not too badly to be held. You feel your hearts link; you know what you have become capable of.","Size":5,"type":"Speech"},"Node13":{"Line0":"./pact","type":"Condition"},"Node14":{"Line0":"The star you reached, whatever else its goals, could only be hostile to life itself. Wherever you saw its influence, people suffered. You used your newfound abilities to protect your people as best you could.","Line1":"Travelers from nearby lands tell your Queen that the Sorcerers in the neighboring kingdom were planning an invasion, but sudden, unexpected misfortunes had begun to hamper their efforts, and their time was now spent combatting these.","Line2":"When the comet had vanished, the star spoke to you once more, demanding the sacrifice it was owed. You offer up the fallen star, as you feel how its use drains your life force, and nothing could fit the conditions better.","Size":3,"type":"Speech"},"Node15":{"Line0":"Who can say whether the comet was in some way the true bringer of the doom that followed?","Line1":"Whatever the truth, when the Sorcerers of the neighboring kingdom used their demonic powers to lead the battle, you were there to meet them.","Line2":"They were more skilled than you, though the powers were similar. You see how they know how to work in tandem with the demon, and it plays off their strengths.","Line3":"To protect your homeland, you are forced to draw on the fallen star, your own demon, more and more. It burns you more with each desperate move.","Line4":"The lengths you go to do turn the tide. The Sorcerers find the city not worth taking with such resistance, and depart.","Size":5,"type":"Speech"},"Node16":{"Line0":"Soon, your life force burned up by the fallen star, you succumb.","Line1":"In future years, the people will speak of your heroic efforts, rebuffing the Sorcerer Dynasty,","Line2":"And of the demon that came with the comet, to lurk in the shadows, emerging to bring ruin when hearts grow weak and desperation rises.","Size":3,"type":"Speech"},"Node17":{"Line0":"In the years to come, the comet's appearance is remembered as a time of hardship, but not of ruin. To some, who understood what transpired over those fateful days, it is reimagined into a symbol of perserverence, sacrifice, and hope.","Line1":"The End","Size":2,"type":"Speech"},"Node2":{"Line0":"Who can say whether the comet itself was the bringer of the doom that followed?","Line1":"Whatever the truth, the Sorcerers of the neighboring kingdom used their demonic powers to lead the battle.","Line2":"Your city fell, and your Queen was struck down.","Line3":"Legends of the comet's time of destruction will be whispered into the far future.","Size":4,"type":"Speech"},"Node3":{"Line0":"The End","Size":1,"type":"Speech"},"Node4":{"Line0":"./pact","type":"Condition"},"Node5":{"Line0":"Perhaps the comet was in the end the cause, but you know that the bargain you entered brought the doom that followed.","Line1":"The star you reached, whatever else its goals, could only be hostile to life itself. Wherever you saw its influence, people suffered, and societies collapsed.","Line2":"The neighboring kingdom did not invade, but this did not protect your own.","Line3":"When the comet had vanished, the star spoke to you once more, demanding the sacrifice it was owed. There was little left you could give it, and what you offered merely hastened the descent.","Size":4,"type":"Speech"},"Node6":{"Size":3,"type":"Mux"},"Node7":{"Line0":"./knows_star_will_fall","type":"Condition"},"Node8":{"Line0":"As the Sun rises, you consider what you learned.","Line1":"Will you seek the fallen star of which you were told?","Size":2,"type":"Speech"},"Node9":{"Line0":"Yes","Line1":"No","Size":2,"type":"Choice"}},"sc":{"Node0":{"0":{"to":"Node7","to_slot":0}},"Node1":{"0":{"to":"Node10","to_slot":0}},"Node10":{"0":{"to":"Node4","to_slot":0}},"Node11":{"0":{"to":"Node10","to_slot":1}},"Node12":{"0":{"to":"Node13","to_slot":0}},"Node13":{"0":{"to":"Node14","to_slot":0},"1":{"to":"Node15","to_slot":0}},"Node14":{"0":{"to":"Node17","to_slot":0}},"Node15":{"0":{"to":"Node16","to_slot":0}},"Node16":{"0":{"to":"Node6","to_slot":2}},"Node2":{"0":{"to":"Node6","to_slot":0}},"Node4":{"0":{"to":"Node5","to_slot":0},"1":{"to":"Node2","to_slot":0}},"Node5":{"0":{"to":"Node6","to_slot":1}},"Node6":{"0":{"to":"Node3","to_slot":0}},"Node7":{"0":{"to":"Node8","to_slot":0},"1":{"to":"Node1","to_slot":0}},"Node8":{"0":{"to":"Node9","to_slot":0}},"Node9":{"0":{"to":"Node12","to_slot":0},"1":{"to":"Node11","to_slot":0}}}}